#include <iostream>
#include <math.h>
using namespace std;
int main()
{
    for (int i = 10; i < 10000; i++) //арифметичний цикл для провірки двоцифрових, трьохцифтрових та чотирьохцифрових чисел
    {
        int number = i, n = i, step = 0, x, sum = 0; //змінні для пошуку числа Армстронга
        while (number != 0) //ітераційнмй цикл для визначення степеня
        {
            number /= 10;
            step++;
        }
        while (n != 0) //ітераційний цикл для визначення суми 
        {
            x = n % 10;
            sum += pow(x, step);
            n /= 10;
        }
        if (sum == i) //перевірка рівності суми чисел з заданим значенням
            cout << i << "\n"; //вивід числа Армстронга
    }
    return 0;
}
