#include<iostream>
#include<cmath>
//імпорт бібліотек потрібних для виконання завдання
using namespace std;

int main()
{
    double  x = 0.56; //заданне значення х
    int n = 0; //нижній ліміт
    double limn = 1; //верхній ліміт
    double s = 0; //початкове значення суми виразів
    while (pow(10, -4) <= limn ) //цикл для обчислення ліміту
    {
  
            s = s + (pow(-1, n) * (pow(x, 2 * n) + 1)) / (pow(2, n) + 1); //фомула задана у задачі
            cout << "sum=" << s << '\n'; //виведення кожної нової суми ліміту
            n++; 
            limn=fabs((pow(x, 2 * n) + 1)) / (pow(2, n) + 1); //формула з модулем для перевірки умови виконання циклу
           
   
    }

    cout << "sum for lim " <<limn << "=" << s; //кінечна сума
    
    return 0;
}