for i in range (10,10000): #ітераційни цикл для двоцифрових, трьлхцифрових та чотирьохцифрових значень
     number = i
     n = i
     step = 0
     x=0
     sum = 0 #змінні для пошуку числа Армстронга
     while number != 0: #ітераційнмй цикл для визначення степеня
        
         number //= 10 
         step+=1
     while n != 0: #ітераційний цикл для визначення суми 
        
         x = n % 10
         sum += pow(x, step)
         n //= 10
        
     if sum == i: #перевірка рівності суми чисел з заданим значенням
            print (i)  #вивід числа Армстронга
    